# GetAnalyticalModelData Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPNetworkIterator..::..GetAnalyticalModelData Method
MEPNetworkIterator Class See Also
---
Gets the analytical model data at the current iteration step.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public MEPAnalyticalModelData GetAnalyticalModelData()
```

Visual Basic
---
```text
Public Function GetAnalyticalModelData As MEPAnalyticalModelData
```

Visual C++
---
```text
public:
MEPAnalyticalModelData^ GetAnalyticalModelData()
```

# ### Return Value
The retrieved model data.
# See Also
MEPNetworkIterator Class
Autodesk.Revit.DB.Analysis Namespace